#+TITLE: December 27, 2019 - January 9, 2020 (14 days)
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 14
  :SPRINTSTART: <2019-12-27 Wed>
  :wpd-akshay196: 1
  :wpd-bhavin192: 1
  :wpd-kurianbenoy: 1
  :END:
** akshay196
*** The Pragmatic Programmer: your journey to mastery - Part II
    :PROPERTIES:
    :ESTIMATED: 10
    :ACTUAL:
    :OWNER: akshay196
    :ID: READ.1576169089
    :TASKID: READ.1576169089
    :END:
    - [ ] Chapter 5. Bend, or Break                (2h)
    - [ ] Chapter 6. Concurrency                   (2h)
    - [ ] Chapter 7. While You Are Coding          (2h)
    - [ ] Chapter 8. Before the Project            (2h)
    - [ ] Chapter 9. Pragmatic Projects            (2h)
*** Jupyter Notebook Foundations
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:
    :OWNER: akshay196
    :ID: READ.1577713184
    :TASKID: READ.1577713184
    :END:
    https://learning.oreilly.com/live-training/courses/jupyter-notebook-foundations/0636920348528/
** bhavin192
*** Rootconf Delhi talk preparation
    :PROPERTIES:
    :ESTIMATED: 9
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       WRITE.1577717861
    :TASKID:   WRITE.1577717861
    :END:
    [[https://hasgeek.com/rootconf/2020-delhi/proposals/your-journey-from-vm-based-deployments-to-kubernet-a3zt2mqvj3vpQmMWDbc6mT][Mapping the journey from VM-based deployments to Kubernetes]]
*** Mastering Distributed Tracing - chapter 8
    :PROPERTIES:
    :ESTIMATED: 2.5
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       READ.1562555265
    :TASKID:   READ.1562555265
    :END:
*** Write blog post about Helm v3 - Part I
    :PROPERTIES:
    :ESTIMATED: 2.5
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       WRITE.1577718004
    :TASKID:   WRITE.1577718004
    :END:
** kurianbenoy
*** Compete in Kaggle DSBowl competition
    :PROPERTIES:
    :ESTIMATED: 10
    :ACTUAL:   3.28
    :OWNER: kurianbenoy
    :ID: DEV.1577503181
    :TASKID: DEV.1577503181
    :END:
    :LOGBOOK:
    CLOCK: [2020-01-05 Sun 11:48]--[2020-01-05 Sun 12:40] =>  0:52
    CLOCK: [2020-01-05 Sun 10:33]--[2020-01-05 Sun 11:37] =>  1:04
    CLOCK: [2020-01-05 Sun 09:36]--[2020-01-05 Sun 10:11] =>  0:35
    CLOCK: [2020-01-04 Sat 23:23]--[2020-01-05 Sun 00:31] =>  1:08
    CLOCK: [2020-01-04 Sat 08:45]--[2020-01-04 Sat 09:30] =>  0:45
    CLOCK: [2020-01-03 Fri 20:11]--[2020-01-03 Fri 21:35] =>  1:24
    CLOCK: [2020-01-02 Thu 06:58]--[2020-01-02 Thu 07:18] =>  0:20
    CLOCK: [2020-01-01 Wed 22:17]--[2020-01-01 Wed 22:23] =>  0:06
    CLOCK: [2019-12-31 Tue 16:57]--[2019-12-31 Tue 17:39] =>  0:42
    :END:
*** Prepare for GATE 2020
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:   3.17
    :OWNER: kurianbenoy
    :ID: READ.1577503246
    :TASKID: READ.1577503246
    :END:
    :LOGBOOK:
    CLOCK: [2020-01-05 Sun 22:29]--[2020-01-05 Sun 23:01] =>  0:32
    CLOCK: [2020-01-05 Sun 22:02]--[2020-01-05 Sun 22:23] =>  0:21
    CLOCK: [2020-01-05 Sun 21:11]--[2020-01-05 Sun 21:39] =>  0:28
    CLOCK: [2020-01-05 Sun 20:34]--[2020-01-05 Sun 20:55] =>  0:21
    CLOCK: [2020-01-05 Sun 19:04]--[2020-01-05 Sun 20:22] =>  1:18
    CLOCK: [2020-01-04 Sat 22:29]--[2020-01-04 Sat 23:09] =>  0:40
    CLOCK: [2020-01-04 Sat 21:33]--[2020-01-04 Sat 22:17] =>  0:44
    CLOCK: [2020-01-03 Fri 16:23]--[2020-01-03-Fri 17:25] =>  1:02
    CLOCK: [2020-01-02 Thu 07:46]--[2020-01-02 Thu 08:09] =>  0:23
    CLOCK: [2020-01-02 Thu 06:49]--[2020-01-02 Thu 06:58] =>  0:09
    CLOCK: [2020-01-02 Thu 05:41]--[2020-01-02 Thu 06:07] =>  0:26
    CLOCK: [2020-01-01 Wed 23:01]--[2020-01-01 Wed 23:49] =>  0:48
    :END:
    
